onexs-xsi/otool_tab5_live2d/sdkconfig.defaults
# ESP32-P4 / M5Stack Tab5 最小配置
# 参考 tab5_breath_control_tool 的 sdkconfig.defaults 裁剪而来

# target
CONFIG_IDF_TARGET="esp32p4"

# flash
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPI_FLASH_HPM_ENA=y

# bootloader（HPM + 120MHz 下默认配置会超过 0x6000 限制，压缩体积）
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# CPU / FreeRTOS
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400
CONFIG_FREERTOS_HZ=1000

# PSRAM（LVGL 绘图缓冲使用）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_FREERTOS_TASK_NOTIFY=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_DRAW_THREAD_STACK_SIZE=8192
CONFIG_LV_DRAW_THREAD_PRIO=3
CONFIG_LV_ASSERT_HANDLER_INCLUDE="lv_assert_override.h"
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_36=y

# 其他
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# REALTIME self-core build (2026-08-21): required for the model demo.
# Custom partition table with 15MB app: embedded model assets (~2.9MB).
# PERF optimization: soft raster is too slow at -Og on-device.
CONFIG_OTOOL_CUBISM_ENABLE_REALTIME=y
CONFIG_OTOOL_CUBISM_CORE_BACKEND_SELF=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
